app/views/likes/_like-btn.html.erb

    <%= link_to post_likes_path(post), method: :delete, remote: true, class: "text-dark" do %>
    ♥<%= post.likes.count %> いいね
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 5]]

    <%= link_to post_likes_path(post), method: :post, remote: true, class: "text-dark" do %>
    ♡<%= post.likes.count %> いいね
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 5]]