app/views/users/chat.html.erb

<% current_user.rooms.each do |room| %>
  <% room.user_rooms.each do |user_room| %>
---
SELECT "rooms".* FROM "rooms" INNER JOIN "user_rooms" ON "rooms"."id" = "user_rooms"."room_id" WHERE "user_rooms"."user_id" = ?  [["user_id", 1]]
SELECT "user_rooms".* FROM "user_rooms" WHERE "user_rooms"."room_id" = ?  [["room_id", 1]]