app/views/homes/index.html.erb

SELECT "genres".* FROM "genres"
---
<p>投稿から探す</p>
<% Genre.all.each do |genre|%>