app/views/posts/_comments.html.erb

<% post.post_comments.each do |post_comment| %>
---
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."post_id" = ?  [["post_id", 1]]