app/views/posts/new.html.erb

SELECT "genres".* FROM "genres"
---
              <%= f.label :ゲームタイトル %>
              <%= f.select :genre_id, Genre.all.map{ |genre| [genre.name, genre.id] }, {include_blank: '選択してください'} %>