app/views/posts/show.html.erb

        <div class="comments">
          <p>コメント件数：<%= @post.post_comments.count %></p>
---
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."post_id" = ?  [["post_id", 2]]
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."post_id" = ?  [["post_id", 2]]

                <%= link_to post_likes_path(@post), method: :post, class: "text-dark" do %>
                  ♡<%= @post.likes.count %> いいね
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 3]]

      <div class="col-md-4">
        <% @post.post_comments.each do |post_comment| %>
---
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."post_id" = ?  [["post_id", 3]]