app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("name", "email", "phone_number", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "a"], ["email", ""], ["phone_number", ""], ["message", "aa"], ["created_at", "2021-08-12 07:12:24.629326"], ["updated_at", "2021-08-12 07:12:24.629326"]]
---
  def create
    @contact = Contact.new(contact_params)
    if @contact.save