app/controllers/genres_controller.rb

  def show
    @genre = Genre.find(params[:id])
    @posts = @genre.posts.page(params[:page]).reverse_order
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."genre_id" = ? ORDER BY "posts"."id" DESC LIMIT ? OFFSET ?  [["genre_id", 1], ["LIMIT", 5], ["OFFSET", 0]]