app/controllers/post_comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "post_comments" ("comment", "user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "aa"], ["user_id", 1], ["post_id", 2], ["created_at", "2021-08-07 07:42:25.352495"], ["updated_at", "2021-08-07 07:42:25.352495"]]
---
  def create
    @post = Post.find(params[:post_id])
    comment = current_user.post_comments.new(post_comment_params)
    comment.post_id = @post.id
    comment.save

DELETE FROM "post_comments" WHERE "post_comments"."id" = ?  [["id", 1]]
SELECT  "post_comments".* FROM "post_comments" WHERE "post_comments"."id" = ? AND "post_comments"."post_id" = ? LIMIT ?  [["id", 1], ["post_id", 2], ["LIMIT", 1]]
---
  def destroy
    PostComment.find_by(id: params[:id], post_id: params[:post_id]).destroy