app/controllers/posts_controller.rb

INSERT INTO "posts" ("user_id", "title", "body", "genre_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["title", "Apex"], ["body", "tesuto"], ["genre_id", 1], ["created_at", "2021-08-08 05:36:47.696112"], ["updated_at", "2021-08-08 05:36:47.696112"]]
---
  def create
    post = Post.new(post_params)
    post.save

SELECT  "posts".* FROM "posts" ORDER BY "posts"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"
---
  def index
    # @posts = Post.where(genre: params[:genre]).page(params[:page]).reverse_order
    @search = Post.ransack(params[:q])
    @posts = @search.result.page(params[:page]).reverse_order