app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "ああa"], ["profile_image_id", "df2e685931f8b5d192ee458e44647400ef662ee0271e4754440a1827e21b"], ["updated_at", "2021-08-09 21:43:23.346268"], ["id", 1]]