app/models/post.rb

  def create_notification_like(current_user)
    # すでに「いいね」されているか検索
    temp = Notification.where(["visitor_id = ? and visited_id = ? and post_id = ? and action = ? ", current_user.id, user_id, id, 'like'])
    # いいねされてなかった場合のみ、通知レコードを作成
    if temp.blank?
---
SELECT  1 AS one FROM "likes" WHERE "likes"."post_id" = ? AND "likes"."user_id" = ? LIMIT ?  [["post_id", 2], ["user_id", 3], ["LIMIT", 1]]